{
   "posts":[
      {
         "id":1,
         "title":"ABB Internship Interview Experience",
         "url":"ABB-Internship-Offer",
         "tags":["internship","job-offer"],
         "image":"image_1.jpg",
         "description":"Finally, Got an Internship in Fortune 500 Company!!",
         "body":"<h2 class=\"mb-3\">\n              Finally, Got an Internship in Fortune 500 Company!!\n            </h2>\n            <p>As an international student, it is very hard to secure the internship in USA. In fact, international student even can't get phone interview so getting a video or in-person interview is a big achievement. In this post, I will write whole internship hunting experience.</p>\n            <p>\n              <img src=\"../images/image_3.jpg\" alt=\"\" class=\"img-fluid\">\n            </p>\n            <p>I'm a graduate student at University of Wisconsin-Milwaukee. I enrolled in fall 2019. In starting of November 2019, I started to apply for the internship application. Big companies already started to hire interns. I show many student post about they got the offer for Summer 2020 internship. I was feeling nervous because I'm getting only online coding challenges. It was bad time for me..</p>\n            <h2 class=\"mb-3 mt-5\">Created Personal Website</h2>\n            <p>I started wondering about what is wrong in my application. And I figured out it's because I'm on F-1 visa. Companies are looking for long-term players only and they have to pay extra money for sponserships. That's the main problem.</p>\n            <p>\n              <img src=\"../images/image_4.jpg\" alt=\"\" class=\"img-fluid\">\n            </p>\n            <p>I need to do something different than other applications so HR can find that.</p>\n            <p>Odit voluptatibus, eveniet vel nihil cum ullam dolores laborum, quo velit commodi rerum eum quidem pariatur! Quia fuga iste tenetur, ipsa vel nisi in dolorum consequatur, veritatis porro explicabo soluta commodi libero voluptatem similique id quidem? Blanditiis voluptates aperiam non magni. Reprehenderit nobis odit inventore, quia laboriosam harum excepturi ea.</p>\n            <p>Adipisci vero culpa, eius nobis soluta. Dolore, maxime ullam ipsam quidem, dolor distinctio similique asperiores voluptas enim, exercitationem ratione aut adipisci modi quod quibusdam iusto, voluptates beatae iure nemo itaque laborum. Consequuntur et pariatur totam fuga eligendi vero dolorum provident. Voluptatibus, veritatis. Beatae numquam nam ab voluptatibus culpa, tenetur recusandae!</p>\n            <p>Voluptas dolores dignissimos dolorum temporibus, autem aliquam ducimus at officia adipisci quasi nemo a perspiciatis provident magni laboriosam repudiandae iure iusto commodi debitis est blanditiis alias laborum sint dolore. Dolores, iure, reprehenderit. Error provident, pariatur cupiditate soluta doloremque aut ratione. Harum voluptates mollitia illo minus praesentium, rerum ipsa debitis, inventore?</p>",
         "published":true,
         "created":"2020-04-23T20:14:14.689Z",
         "updated":"2020-04-23T20:14:14.689Z"
      },
      {
         "id":2,
         "title":"A Wonderful Blog Post About Earth",
         "url":"A-Wonderful-Blog-Post-About-Earth",
         "tags":["css","html"],
         "image":"image_2.jpg",
         "description":"Finally, Got an Internship in Fortune 500 Company!!",
         "body":"When I orbited the Earth in a spaceship, I saw for the first time how beautiful our planet is. Mankind, let us preserve and increase this beauty, and not destroy it!Space, the final frontier. These are the voyages of the Starship Enterprise. Its five-year mission: to explore strange new worlds, to seek out new life and new civilizations, to boldly go where no man has gone before.If you could see the earth illuminated when you were in a place as dark as night, it would look to you more splendid than the moon.To be the first to enter the cosmos, to engage, single-handed, in an unprecedented duel with nature—could one dream of anything more?We choose to go to the moon in this decade and do the other things, not because they are easy, but because they are hard, because that goal will serve to organize and measure the best of our energies and skills, because that challenge is one that we are willing to accept, one we are unwilling to postpone, and one which we intend to win.NASA is not about the ‘Adventure of Human Space Exploration’…We won’t be doing it just to get out there in space – we’ll be doing it because the things we learn out there will be making life better for a lot of people who won’t be able to go.Problems look mighty small from 150 miles up.That's one small step for [a] man, one giant leap for mankind.Where ignorance lurks, so too do the frontiers of discovery and imagination.Dinosaurs are extinct today because they lacked opposable thumbs and the brainpower to build a space program.",
         "published":true,
         "created":"2020-04-06T20:14:14.689Z",
         "updated":"2020-04-06T20:14:14.689Z"
      },
      {
         "id":3,
         "title":"React Blog Github (Test Issue) 1",
         "url":"third-post",
         "tags":["css","html"],
         "image":"image_3.jpg",
         "description":"Finally, Got an Internship in Fortune 500 Company!!",
         "body":"Read usage information and more on Github. These tell git to add all the work that you’ve done so far into one tidy package called a “commit.” Then, it names your commit to represent the changes that you’ve made. For my first commit, I always call it “initial commit.” However, if you just built your header HTML, you might call your commit “header HTML.” You should see something like this:",
         "published":true,
         "created":"2020-04-15T20:14:14.689Z",
         "updated":"2020-04-15T20:14:14.689Z"
      }
   ]
}