{
   "posts":[
      {
         "id":1,
         "title":"React Github Blog Test",
         "url":"React-Github-Blog-Test",
         "tags":["react","github","github-pages","programming", "self-improvement"],
         "image":"blog/React-Blog-Github-Test-logo.png",
         "description":"First post of my blogging!!",
         "body":"<h2 className=\"mb-3\"> First post of my blogging!! </h2> <p>I want to include blogs in my personal website so I decided to use react for dynamic site. As everyone knows, currently react is boomming the market.</p> <p>This is my first post of the blogging. Currently, there is a COVID-19 pandemic situation in every country. My university classes converted to online so I have free time to improve my programming. So, I will convert my html site to react by own. Also, I will use github pages to host my website. Currently, github pages allows to host free without any backend language. So, I will not use any backend programming and database.</p> <p>This is it for the first blog. Thank you. Current motto is Stay Home Stay Safe.</p>",
         "published":true,
         "created":"2020-04-15T20:14:14.689Z",
         "updated":"2020-04-15T20:14:14.689Z"
      },
      {
         "id":2,
         "title":"ABB Internship Interview Experience",
         "url":"ABB-Internship-Offer",
         "tags":["internship","job-offer"],
         "image":"blog/ABB-Internship-Offer-logo.png",
         "description":"Finally, Got an Internship in Fortune 500 Company!!",
         "body":"<h2 className=\"mb-3\"> Finally, Got an Internship in Fortune 500 Company!! </h2> <p>As an international student, it is very hard to secure the internship in USA. In fact, international student even can't get phone interview so getting a video or in-person interview is a big achievement. In this post, I will write whole internship hunting experience.</p> <p>I'm a graduate student at University of Wisconsin-Milwaukee. I enrolled in fall 2019. In starting of November 2019, I started to apply for the internship application. Big companies already started to hire interns. I show many student post about they got the offer for Summer 2020 internship. I was feeling nervous because I'm getting only online coding challenges. It was bad time for me..</p> <h2 className=\"mb-3 mt-5\">Created Personal Website</h2> <p>I started wondering about what is wrong in my application. And I figured out it's because I'm on F-1 visa. Companies are looking for long-term players only and they have to pay extra money for sponserships. That's the main problem.</p> <p>I need to do something different than other applications so I thought I should create my portfolio. Many people suggest that resume must be only 1 page. But, I can only put few information in my resume so personal website is a good idea to include more project information.</p> <p>So, I created static website before January 2020.</p> <p>Note: I created this website without any cost. Also, I hosted it free on <a href=\"https://pages.github.com/\">github pages</a>. I will create separate blog for this.</p> <h2 className=\"mb-3 mt-5\">University Career & Internship Fair </h2> <p>I attended career fair in the end of the February 2020 at my <a href=\"https://uwm.edu/careerplan/students-2/jobs-internships/career-fairs/\">university</a>. However, I have applied to more than 200 companies for software development positions before career fair.</p> <p>After attending career fair, I was feeling it is worthless because many companies representative don't know anything about the position. They gives business card or page and ask me to apply through online by mentioned website. They are not even interested to take a look at the resume. Many companies do not hire internation students, they are looking for us citizens. But, I went to every companies table and leave my resume.</p> <h2 className=\"mb-3 mt-5\">Got Emails from Few Companies</h2> <p>One week passed after attending career fair. I even stopped to apply for new companies because of frustration. I responed to email and scheduled in-person interview with 2 companies. One of that are ABB(I got an email from ABB on Friday March 6th). I went to ABB site office on Tuesday March 10th. </p> <p>The interview went well. I was confident that I will get this job. After 2 days(March 12th), I got an congratulation email from my manager. I was so happy on that day. I like to thanks my manger for trusting on me. Happy ending :)</p> <p><img src=\"/images/blog/ABB-Internship-Offer-logo.png\" alt className=\"img-fluid\" /></p> <p>I did not mention about how I got an in-person interview. As I said earlier, I went to every company table in my university career fair. After one week, ABB's manager emailed me that he got an resume from the HR department and he is looking for intern to complete one project in the summer. So, the university career fair helped me to get an summer internship in my case even I was thinking career fair is worthless.</p> <p>I know that was a long post but this is it, my full experience and journey into getting an offer from ABB. Interviewing is a lot about luck, trust me, but the only thing in your hand is practice and perseverance. I was lucky but prepared. <h4> Goodluck with your journey!</h4></p> ",
         "published":true,
         "created":"2020-04-23T20:14:14.689Z",
         "updated":"2020-04-23T20:14:14.689Z"
      },
      {
         "id":3,
         "title":"How to call external Javascript file function from react component",
         "url":"How-to-call-external-Javascript-file-function-from-react-component",
         "tags":["react","javascript","programming", "self-improvement"],
         "image":"blog/How-to-call-external-Javascript-file-function-from-react-component-logo.png",
         "description":"Is there any way to call external js file function from inside react component?",
         "body":"<h1 className=\"mb-3\"> Is there any way to call external js file function from inside react component? </h1> <h4>The answer is <b>Yes</b>.</h4> <p><img src=\"/images/blog/ABB-Internship-Offer-logo.png\" alt className=\"img-fluid\" /></p> <h2 className=\"mb-3 mt-5\">Problem Scenario</h2> <p>Case 1: Suppose, you have an index.html file that includes some javascript. Now on your react component, you have a condition that will render only if the condition is true. This means that initially when the page loaded the component has not been rendered yet. When button toggled this is where that component gets rendered. That child component needs to call a javascript method that was included on your external javascript file or inside index.html javascript code. So, how can you do this?</p> <p>Case 2: Your external javascript function calls when the first time you open the website but when react router changes the component it's not calling that function. I have faced this situation to convert my static website to dynamically. The problem was: there is a jquery function that runs on div tags, class, id events. But, in react the page is never refreshed so jquery runs smoothly first time. After routes change it is not execute the function again. So, data was not displayed on my second page due to jquery animation code.</p> <h2 className=\"mb-3 mt-5\">Solution</h2> <p>Currently, I'm learning the react by own so I have spent many time to find the solution.</p> <p>Here is the solution. For exaple, you have function inside the index.html file. In that case, you can use componentDidMount function and call that function using window.functionName(). You can check more details about componentDidMount <a href=\"https://reactjs.org/docs/react-component.html#componentdidmount\">here.</a></p> <figure> <figcaption>In index.html</figcaption> <pre><code>&lt;script type=\"text/javascript\"&gt; function test(){ alert('Function from index.html'); } &lt;/script&gt; </code></pre> </figure>\n\n<figure> <figcaption>In your component</figcaption> <pre><code>componentDidMount: function(){ window.test(); } </code></pre> </figure> <p> Suppose, you have external javascript file and want to rerun whole code then you have to wrap whole code in one function. Add first and last line from below in your external js file. </p> <pre><code>function globalFunction() { //....your whole javascript file code } </code></pre> <figure> <figcaption>Now in your component</figcaption> <pre><code>componentDidMount: function(){ window.globalFunction(); } </code></pre> </figure> <p> Overall, componentDidMount function execute the code everytime after it rendered, that's the meaning of the function. There are many soluction you can find about onUpdate event in Router tag or onEnter event in route tag. But, these all are the deprected in the react new version. So, follow this to save your precious time. <b>Please check this post date to verify componentDidMount is not deprecated.</b> </p>",
         "published":true,
         "created":"2020-04-30T03:25:50.844Z",
         "updated":"2020-04-30T03:25:50.844Z"
      },
      {
         "id":4,
         "title":"On my way to build mobile application development",
         "url":"On-my-way-to-build-mobile-application-development",
         "tags":["react-native","javascript","programming", "self-improvement"],
         "image":"blog/On-my-way-to-build-mobile-application-development.png",
         "description":"Stepping into mobile application development",
         "body":"<h1 className=\"mb-3\"> Stepping into mobile application development </h1> <p>I always wanted to create the mobile application but I didn't get much time to learn new programming language and create some really cool app.</p> <p><img src=\"/images/blog/On-my-way-to-build-mobile-application-development.png\" alt className=\"img-fluid\" /></p> <p>Today, my two classes all submission completed. So, I don't have to worry about those classes and left with one class. In that class, one paper and project submission remaining, and my final submission due is May 15th. After that, my internship will start from June 1st.</p> <h2 className=\"mb-3 mt-5\">Time availability</h2> <p>Overall, I have one month to learn mobile application development. I'm gonna learn react native as I transferred my static website to react so it will be easy to lear react native now(I already prepared for this).</p> <p>I also want to know how chrome push notification work so I will spend some time on that.</p> <p>Happy coding!!!!!</p> ",
         "published":true,
         "created":"2020-05-01T00:52:58.364Z",
         "updated":"2020-05-01T00:52:58.364Z"
      }
   ]
}