{
   "posts":[
      {
         "id":1,
         "title":"React Github Blog Test",
         "url":"React-Github-Blog-Test",
         "tags":["react","github","github-pages","programming", "self-improvement"],
         "image":"blog/React-Blog-Github-Test-logo.png",
         "description":"First post of my blogging!!",
         "body":"<h2 class=\"mb-3\"> First post of my blogging!! </h2> <p>I want to include blogs in my personal website so I decided to use react for dynamic site. As everyone knows, currently react is boomming the market.</p> <p>This is my first post of the blogging. Currently, there is a COVID-19 pandemic situation in every country. My university classes converted to online so I have free time to improve my programming. So, I will convert my html site to react by own. Also, I will use github pages to host my website. Currently, github pages allows to host free without any backend language. So, I will not use any backend programming and database.</p> <p>This is it for the first blog. Thank you. Current motto is Stay Home Stay Safe.</p>",
         "published":true,
         "created":"2020-04-15T20:14:14.689Z",
         "updated":"2020-04-15T20:14:14.689Z"
      },
      {
         "id":2,
         "title":"ABB Internship Interview Experience",
         "url":"ABB-Internship-Offer",
         "tags":["internship","job-offer"],
         "image":"blog/ABB-Internship-Offer-logo.png",
         "description":"Finally, Got an Internship in Fortune 500 Company!!",
         "body":"<h2 class=\"mb-3\"> Finally, Got an Internship in Fortune 500 Company!! </h2> <p>As an international student, it is very hard to secure the internship in USA. In fact, international student even can't get phone interview so getting a video or in-person interview is a big achievement. In this post, I will write whole internship hunting experience.</p> <p>I'm a graduate student at University of Wisconsin-Milwaukee. I enrolled in fall 2019. In starting of November 2019, I started to apply for the internship application. Big companies already started to hire interns. I show many student post about they got the offer for Summer 2020 internship. I was feeling nervous because I'm getting only online coding challenges. It was bad time for me..</p> <h2 class=\"mb-3 mt-5\">Created Personal Website</h2> <p>I started wondering about what is wrong in my application. And I figured out it's because I'm on F-1 visa. Companies are looking for long-term players only and they have to pay extra money for sponserships. That's the main problem.</p> <p>I need to do something different than other applications so I thought I should create my portfolio. Many people suggest that resume must be only 1 page. But, I can only put few information in my resume so personal website is a good idea to include more project information.</p> <p>So, I created static website before January 2020.</p> <p>Note: I created this website without any cost. Also, I hosted it free on <a href=\"https://pages.github.com/\">github pages</a>. I will create separate blog for this.</p> <h2 class=\"mb-3 mt-5\">University Career & Internship Fair </h2> <p>I attended career fair in the end of the February 2020 at my <a href=\"https://uwm.edu/careerplan/students-2/jobs-internships/career-fairs/\">university</a>. However, I have applied to more than 200 companies for software development positions before career fair.</p> <p>After attending career fair, I was feeling it is worthless because many companies representative don't know anything about the position. They gives business card or page and ask me to apply through online by mentioned website. They are not even interested to take a look at the resume. Many companies do not hire internation students, they are looking for us citizens. But, I went to every companies table and leave my resume.</p> <h2 class=\"mb-3 mt-5\">Got Emails from Few Companies</h2> <p>One week passed after attending career fair. I even stopped to apply for new companies because of frustration. I responed to email and scheduled in-person interview with 2 companies. One of that are ABB(I got an email from ABB on Friday March 6th). I went to ABB site office on Tuesday March 10th. </p> <p>The interview went well. I was confident that I will get this job. After 2 days(March 12th), I got an congratulation email from my manager. I was so happy on that day. I like to thanks my manger for trusting on me. Happy ending :)</p> <p><img src=\"/images/blog/ABB-Internship-Offer-logo.png\" alt class=\"img-fluid\" /></p> <p>I did not mention about how I got an in-person interview. As I said earlier, I went to every company table in my university career fair. After one week, ABB's manager emailed me that he got an resume from the HR department and he is looking for intern to complete one project in the summer. So, the university career fair helped me to get an summer internship in my case even I was thinking career fair is worthless.</p> <p>I know that was a long post but this is it, my full experience and journey into getting an offer from ABB. Interviewing is a lot about luck, trust me, but the only thing in your hand is practice and perseverance. I was lucky but prepared. <h4> Goodluck with your journey!</h4></p> ",
         "published":true,
         "created":"2020-04-23T20:14:14.689Z",
         "updated":"2020-04-23T20:14:14.689Z"
      },
      {
         "id":3,
         "title":"How to call external Javascript file function from react component",
         "url":"How-to-call-external-Javascript-file-function-from-react-component",
         "tags":["react","javascript","programming", "self-improvement"],
         "image":"blog/How-to-call-external-Javascript-file-function-from-react-component-logo.png",
         "description":"Is there any way to call external js file function from inside react component?",
         "body":"<h1 class=\"mb-3\"> Is there any way to call external js file function from inside react component? </h1> <h4>The answer is <b>Yes</b>.</h4> <p><img src=\"/images/blog/ABB-Internship-Offer-logo.png\" alt class=\"img-fluid\" /></p> <h2 class=\"mb-3 mt-5\">Problem Scenario</h2> <p>Case 1: Suppose, you have an index.html file that includes some javascript. Now on your react component, you have a condition that will render only if the condition is true. This means that initially when the page loaded the component has not been rendered yet. When button toggled this is where that component gets rendered. That child component needs to call a javascript method that was included on your external javascript file or inside index.html javascript code. So, how can you do this?</p> <p>Case 2: Your external javascript function calls when the first time you open the website but when react router changes the component it's not calling that function. I have faced this situation to convert my static website to dynamically. The problem was: there is a jquery function that runs on div tags, class, id events. But, in react the page is never refreshed so jquery runs smoothly first time. After routes change it is not execute the function again. So, data was not displayed on my second page due to jquery animation code.</p> <h2 class=\"mb-3 mt-5\">Solution</h2> <p>Currently, I'm learning the react by own so I have spent many time to find the solution.</p> <p>Here is the solution. For exaple, you have function inside the index.html file. In that case, you can use componentDidMount function and call that function using window.functionName(). You can check more details about componentDidMount <a href=\"https://reactjs.org/docs/react-component.html#componentdidmount\">here.</a></p> <figure> <figcaption>In index.html</figcaption> <pre><code>&lt;script type=\"text/javascript\"&gt; function test(){ alert('Function from index.html'); } &lt;/script&gt; </code></pre> </figure>\n\n<figure> <figcaption>In your component</figcaption> <pre><code>componentDidMount: function(){ window.test(); } </code></pre> </figure> <p> Suppose, you have external javascript file and want to rerun whole code then you have to wrap whole code in one function. Add first and last line from below in your external js file. </p> <pre><code>function globalFunction() { //....your whole javascript file code } </code></pre> <figure> <figcaption>Now in your component</figcaption> <pre><code>componentDidMount: function(){ window.globalFunction(); } </code></pre> </figure> <p> Overall, componentDidMount function execute the code everytime after it rendered, that's the meaning of the function. There are many soluction you can find about onUpdate event in Router tag or onEnter event in route tag. But, these all are the deprected in the react new version. So, follow this to save your precious time. <b>Please check this post date to verify componentDidMount is not deprecated.</b> </p>",
         "published":true,
         "created":"2020-04-30T03:25:50.844Z",
         "updated":"2020-04-30T03:25:50.844Z"
      },
      {
         "id":4,
         "title":"On my way to build mobile application",
         "url":"On-my-way-to-build-mobile-application",
         "tags":["react-native","javascript","programming", "self-improvement"],
         "image":"blog/On-my-way-to-build-mobile-application-logo.png",
         "description":"Stepping into mobile application development",
         "body":"<h1 class=\"mb-3\"> Stepping into mobile application development </h1> <p>I always wanted to create the mobile application but I didn't get much time to learn new programming language and create some really cool app.</p> <p><img src=\"/images/blog/On-my-way-to-build-mobile-application-development.png\" alt class=\"img-fluid\" /></p> <p>Today, my two classes all submission completed. So, I don't have to worry about those classes and left with one class. In that class, one paper and project submission remaining, and my final submission due is May 15th. After that, my internship will start from June 1st.</p> <h2 class=\"mb-3 mt-5\">Time availability</h2> <p>Overall, I have one month to learn mobile application development. I'm gonna learn react native as I transferred my static website to react so it will be easy to lear react native now(I already prepared for this). I have couple of ideas to create cool application. Wish me luck :)</p> <p>I also want to know how chrome push notification work so I will spend some time on that as well.</p> <p>Happy coding!!!!!</p> ",
         "published":true,
         "created":"2020-05-01T00:52:58.364Z",
         "updated":"2020-05-01T00:52:58.364Z"
      },
      {
         "id":5,
         "title":"The Secret of 100% Commitment and Success is 10 Behaviors",
         "url":"the-secret-of-100-commitment-and-success-is-10-behaviors",
         "tags":["motivation","inspiration","life-lesson"],
         "image":"blog/the-secret-of-100-commitment-and-success-is-10-behaviors-logo.png",
         "description":"The bigger your future, the better your present.",
         "body":"<h1 class=\"mb-3\"> The bigger your future, the better your present. </h1>\n<p>Today's motivation by <a href=\"https://medium.com/@benjaminhardy\" alt>Benjamin Hardy </a></p>\n<p><img src=\"/images/blog/the-secret-of-100-commitment-and-success-is-10-behaviors-logo.png\" alt class=\"img-fluid\" /></p>\n<p>\n    When you have a specific future you are striving for and committed to, your present circumstances and experiences take on a new meaning. You’re able to convert your experience — even your painful experience — into learning, growth, and change. If you don’t have a future you’re actively striving for, then you can’t actively convert your experience into learning. \n</p>\n<p>\n    When you’re committed to a bigger future, your present becomes far less predictable. Rather than living within the confines of your narrow comfort zone, you begin embracing uncertainty. You begin stepping outside of your “known” world and begin approaching the world of your Future Self.\n</p>\n<p>\n    Below skills can achieve incredible things in your life.\n</p>\n<h2 class=\"mb-3 mt-5\">1. Define Your Future Self (No More Than 3 Years Out)</h2>\n<p>\n    Psychologists call active learning “deliberate practice.” You can’t engage in such “practice” or learning unless you have a very clear goal. You need a clear goal and also a clear future identity, as the person you plan to become.\n</p>\n<h2 class=\"mb-3 mt-5\">2. Start Getting All of the Information You Possibly Can</h2>\n<p>\n    Once you’ve defined your own future self, you need to start getting information. You need to develop a clear goal and plan to become your future self.\n</p>\n<p><img src=\"/images/blog/the-secret-of-100-commitment-and-success-is-10-behaviors-1.png\" alt class=\"img-fluid\" /></p>\n\n<h2 class=\"mb-3 mt-5\">3. Tell Everyone About Your Plan</h2>\n<p>\n    It takes courage to be open about your goals. It takes courage to be open about your failings.\n</p>\n<p>\n    Mr. Rogers said: “Anything that’s human is mentionable, and anything that is mentionable can be more manageable. When we can talk about our feelings, they become less overwhelming, less upsetting, and less scary. The people we trust with that important talk can help us know that we are not alone.”\n</p>\n<p>\n    It means that when you become more open and honest as a person, life becomes far more manageable. You stop needlessly suffering internally about unfulfilled dreams or former hurts. You move forward. And that’s the freaking key! Moving forward! That’s where we are about here. Moving forward as powerfully and authentically as possible.\n</p>\n\n<h2 class=\"mb-3 mt-5\">4. Invest at the Level of Your Future Self</h2>\n<p>Investing in yourself, then, is also about your network of relationships. You are only as good as your network. The more successful you become, the more life becomes about “Who” instead of “How.” The worst thing you could do is trying “going it alone” on your goals. Going it alone is a demonstration of a lack of commitment.\n</p>\n<p><img src=\"/images/blog/the-secret-of-100-commitment-and-success-is-10-behaviors-2.png\" alt class=\"img-fluid\" /></p>\n<h2 class=\"mb-3 mt-5\">5. Eliminate Everything that Discourages Your Future Self</h2>\n<p>\n    Stepping out of the comfort zone of your current persona and subconscious is risky. It involves uncertainty and courage. Given this fact, you need the stability and support of encouraging friends and loved ones.\n</p>\n<p>\n    Beyond relationships, you need to remove the information and experiences that are triggering your current and former selves. Zig Ziglar said, “Your input determines your outlook. Your outlook determines your output, and your output determines your future.”\n</p>\n<h2 class=\"mb-3 mt-5\">6. Write in Your Journal Every Morning About Your Future Self</h2>\n<p>\n    There’s a lot going on in your world. Taking 10–20 minutes every day, ideally at the start of the day, to express your thoughts and feelings is how you reduce your internal sufferings and make life manageable.\n</p>\n<p>\n    Writing in your goals every day is essential to optimizing your life. If you want the best possible results, write about your goals and dreams every day. When you’re struggling emotions, write about your emotions. By giving them form, you’ll stop suffering and be enabled to move forward.\n</p>\n<p><b>Be incredibly honest with yourself.</b></p>\n<h2 class=\"mb-3 mt-5\">7. Define 1–3 Actions You Can Make Daily Toward Your Goal</h2>\n<p>There is a fundamental difference between urgent and important activities. Life is filled with urgencies. But your future self is in the “important” category. Anything that is “important” can easily be procrastinated and put off. </p>\n<p><img src=\"/images/blog/the-secret-of-100-commitment-and-success-is-10-behaviors-3.png\" alt class=\"img-fluid\" /></p>\n<p>\n    When you’re focused on your future self, you don’t need a big to-do list. Instead, you need a focused and short list. Just 1–3 items each day. Count your wins. Make meaningful progress. \n</p>\n<h2 class=\"mb-3 mt-5\">8. “Eat the Frog” Every Single Day</h2>\n<p>\n    If you’re committed to your dreams, make progress on them before you do anything else. Even if that means you must get up early. If you make progress toward your “important” dreams, you’ll be a better person throughout your day. You’ll be happier in your relationships. You’ll have better energy. You’ll be congruent. You’ll be hopeful and happy. You’ll energize others in a powerful way. You’ll get out of your head with feelings of regret. Thus, you’ll be more present.\n</p>\n<p><b>If you eat the frog every morning, you will live your dreams.</b></p>\n<h2 class=\"mb-3 mt-5\">9. Report Your Progress Daily to Your Accountability Partner (This Takes 1 Minute/Day)</h2>\n<p>The above picture turns accountability into a single text message each evening. You report how you did on your Big-3(win/out of all) and list your Big-3 for the next day. There’s an added benefit to listing your Big-3 the night before, and that’s that you get to go to bed with a purpose.</p>\n<p>\n    By going to bed with a purpose, you can wake up motivated and with a plan. This allows you to avoid needless decision fatigue the next morning.\n</p>\n\n\n<h2 class=\"mb-3 mt-5\">10. Completely Unplug Every Single Day</h2>\n<p>\n    Last but not least, you need to fully “unplug” for large intervals throughout your day. There’s a lot of research on Psychological detachment from work. True psychological detachment occurs when you completely refrain from work-related activities and thoughts during non-work time.\n</p>\n<p>\n    Research has shown that only 16 percent of respondents reported getting creative insight while at work. Ideas generally came while the person was at home or in transportation, or during recreational activity<b>(Happens with me most of the time)</b>. “The most creative ideas aren’t going to come while sitting in front of your monitor,” says Scott Birnbaum, a vice president of Samsung Semiconductor.\n</p>\n<p>\n    The reason for this is simple. When you’re working directly on a task, your mind is tightly focused on the problem at hand (i.e., direct reflection). Conversely, when you’re not working, your mind loosely wanders (i.e., indirect reflection).\n</p>\n<p>\n    Creativity is a skill you can develop. As is clarity and insight. You’ll get much more when you take time to rest and recover. You need to fully unplug and be actively engaged in other areas of your life.\n</p>\n\n<p>\n    I wrote this post inspired by Benjamin Hardy's post on Medium. You can check full post <a href=\"https://medium.com/@benjaminhardy/ready-to-commit-100-to-your-dreams-here-are-the-10-steps-14e4c01c71ec\">here</a>.\n</p>",
         "published":true,
         "created":"2020-05-01T03:38:55.541Z",
         "updated":"2020-05-01T03:38:55.541Z"
      }
   ]
}