{
   "posts": [
      {
         "id": 1,
         "title": "React Github Blog Test",
         "url": "React-Github-Blog-Test",
         "tags": [
            "react",
            "github-pages"
         ],
         "image": "blog/React-Blog-Github-Test-logo.png",
         "description": "First post of my blogging!!",
         "body": "<h2 class=\"mb-3\"> First post of my blogging!! </h2> <p>I want to include blogs in my personal website so I decided to use react for dynamic site. As everyone knows, currently react is boomming the market.</p> <p>This is my first post of the blogging. Currently, there is a COVID-19 pandemic situation in every country. My university classes converted to online so I have free time to improve my programming. So, I will convert my html site to react by own. Also, I will use github pages to host my website. Currently, github pages allows to host free without any backend language. So, I will not use any backend programming and database.</p> <p>This is it for the first blog. Thank you. Current motto is Stay Home Stay Safe.</p>",
         "published": true,
         "created": "2020-04-15T20:14:14.689Z",
         "updated": "2020-04-15T20:14:14.689Z"
      },
      {
         "id": 2,
         "title": "ABB Internship Interview Experience",
         "url": "ABB-Internship-Offer",
         "tags": [
            "internship",
            "abb",
            "job-offer"
         ],
         "image": "blog/ABB-Internship-Offer-logo.png",
         "description": "Finally, Got an Internship in Fortune 500 Company!!",
         "body": "<h2 class=\"mb-3\"> Finally, Got an Internship in Fortune 500 Company!! </h2> <p>As an international student, it is very hard to secure the internship in USA. In fact, international student even can't get phone interview so getting a video or in-person interview is a big achievement. In this post, I will write whole internship hunting experience.</p> <p>I'm a graduate student at University of Wisconsin-Milwaukee. I enrolled in fall 2019. In starting of November 2019, I started to apply for the internship application. Big companies already started to hire interns. I show many student post about they got the offer for Summer 2020 internship. I was feeling nervous because I'm getting only online coding challenges. It was bad time for me..</p> <h2 class=\"mb-3 mt-5\">Created Personal Website</h2> <p>I started wondering about what is wrong in my application. And I figured out it's because I'm on F-1 visa. Companies are looking for long-term players only and they have to pay extra money for sponserships. That's the main problem.</p> <p>I need to do something different than other applications so I thought I should create my portfolio. Many people suggest that resume must be only 1 page. But, I can only put few information in my resume so personal website is a good idea to include more project information.</p> <p>So, I created static website before January 2020.</p> <p>Note: I created this website without any cost. Also, I hosted it free on <a href=\"https://pages.github.com/\" target=\"_blank\" rel=\"noopener noreferrer\">github pages</a>. I will create separate blog for this.</p> <h2 class=\"mb-3 mt-5\">University Career & Internship Fair </h2> <p>I attended career fair in the end of the February 2020 at my <a href=\"https://uwm.edu/careerplan/students-2/jobs-internships/career-fairs/\" target=\"_blank\" rel=\"noopener noreferrer\">university</a>. However, I have applied to more than 200 companies for software development positions before career fair.</p> <p>After attending career fair, I was feeling it is worthless because many companies representative don't know anything about the position. They gives business card or page and ask me to apply through online by mentioned website. They are not even interested to take a look at the resume. Many companies do not hire internation students, they are looking for us citizens. But, I went to every companies table and leave my resume.</p> <h2 class=\"mb-3 mt-5\">Got Emails from Few Companies</h2> <p>One week passed after attending career fair. I even stopped to apply for new companies because of frustration. I responed to email and scheduled in-person interview with 2 companies. One of that are ABB(I got an email from ABB on Friday March 6th). I went to ABB site office on Tuesday March 10th. </p> <p>The interview went well. I was confident that I will get this job. After 2 days(March 12th), I got an congratulation email from my manager. I was so happy on that day. I like to thanks my manger for trusting on me. Happy ending :)</p> <p><img src=\"/images/blog/ABB-Internship-Offer-logo.png\" alt class=\"img-fluid\" /></p> <p>I did not mention about how I got an in-person interview. As I said earlier, I went to every company table in my university career fair. After one week, ABB's manager emailed me that he got an resume from the HR department and he is looking for intern to complete one project in the summer. So, the university career fair helped me to get an summer internship in my case even I was thinking career fair is worthless.</p> <p>I know that was a long post but this is it, my full experience and journey into getting an offer from ABB. Interviewing is a lot about luck, trust me, but the only thing in your hand is practice and perseverance. I was lucky but prepared. <h4> Goodluck with your journey!</h4></p> ",
         "published": false,
         "created": "2020-04-23T20:14:14.689Z",
         "updated": "2020-04-23T20:14:14.689Z"
      },
      {
         "id": 3,
         "title": "How to call external Javascript file function from react component",
         "url": "How-to-call-external-Javascript-file-function-from-react-component",
         "tags": [
            "react",
            "javascript"
         ],
         "image": "blog/How-to-call-external-Javascript-file-function-from-react-component-logo.png",
         "description": "Is there any way to call external js file function from inside react component?",
         "body": "<h1 class=\"mb-3\"> Is there any way to call external js file function from inside react component? </h1> <h4>The answer is <b>Yes</b>.</h4> <p><img src=\"/images/blog/How-to-call-external-Javascript-file-function-from-react-component-logo.png\" alt class=\"img-fluid\" /></p> <h2 class=\"mb-3 mt-5\">Problem Scenario</h2> <p>Case 1: Suppose, you have an index.html file that includes some javascript. Now on your react component, you have a condition that will render only if the condition is true. This means that initially when the page loaded the component has not been rendered yet. When button toggled this is where that component gets rendered. That child component needs to call a javascript method that was included on your external javascript file or inside index.html javascript code. So, how can you do this?</p> <p>Case 2: Your external javascript function calls when the first time you open the website but when react router changes the component it's not calling that function. I have faced this situation to convert my static website to dynamically. The problem was: there is a jquery function that runs on div tags, class, id events. But, in react the page is never refreshed so jquery runs smoothly first time. After routes change it is not execute the function again. So, data was not displayed on my second page due to jquery animation code.</p> <h2 class=\"mb-3 mt-5\">Solution</h2> <p>Currently, I'm learning the react by own so I have spent many time to find the solution.</p> <p>Here is the solution. For exaple, you have function inside the index.html file. In that case, you can use componentDidMount function and call that function using window.functionName(). You can check more details about componentDidMount <a href=\"https://reactjs.org/docs/react-component.html#componentdidmount\" target=\"_blank\" rel=\"noopener noreferrer\">here.</a></p> <figure> <figcaption>In index.html</figcaption> <pre><code>&lt;script type=\"text/javascript\"&gt;\nfunction test() { \n\talert('Function from index.html');\n}\n&lt;/script&gt; </code></pre> </figure>\n\n<figure> <figcaption>In your component</figcaption> <pre><code>componentDidMount() {\n    window.test();\n}</code></pre> </figure> <p> Suppose, you have external javascript file and want to rerun whole code then you have to wrap whole code in one function. Add first and last line from below in your external js file. </p> <pre><code>function globalFunction() { \n    //....your whole javascript file code \n} </code></pre> <figure> <figcaption>Now in your component</figcaption> <pre><code>componentDidMount() {\n    window.globalFunction();\n}</code></pre> </figure> <p> Overall, componentDidMount function execute the code everytime after it rendered, that's the meaning of the function. There are many soluction you can find about onUpdate event in Router tag or onEnter event in route tag. But, these all are the deprected in the react new version. So, follow this to save your precious time. <b>Please check this post date to verify componentDidMount is not deprecated.</b> </p>",
         "published": true,
         "created": "2020-04-30T03:25:50.844Z",
         "updated": "2020-04-30T03:25:50.844Z"
      },
      {
         "id": 4,
         "title": "On my way to build mobile application",
         "url": "On-my-way-to-build-mobile-application",
         "tags": [
            "react-native"
         ],
         "image": "blog/On-my-way-to-build-mobile-application-logo.png",
         "description": "Stepping into mobile application development",
         "body": "<h1 class=\"mb-3\"> Stepping into mobile application development </h1> <p>I always wanted to create the mobile application but I didn't get much time to learn new programming language and create some really cool app.</p> <p><img src=\"/images/blog/On-my-way-to-build-mobile-application-development-logo.png\" alt class=\"img-fluid\" /></p> <p>Today, my two classes all submission completed. So, I don't have to worry about those classes and left with one class. In that class, one paper and project submission remaining, and my final submission due is May 15th. After that, my internship will start from June 1st.</p> <h2 class=\"mb-3 mt-5\">Time availability</h2> <p>Overall, I have one month to learn mobile application development. I'm gonna learn react native as I transferred my static website to react so it will be easy to lear react native now(I already prepared for this). I have couple of ideas to create cool application. Wish me luck :)</p> <p>I also want to know how chrome push notification work so I will spend some time on that as well.</p> <p>Happy coding!!!!!</p> ",
         "published": true,
         "created": "2020-05-01T00:52:58.364Z",
         "updated": "2020-05-01T00:52:58.364Z"
      },
      {
         "id": 5,
         "title": "The Secret of 100% Commitment and Success is 10 Behaviors",
         "url": "the-secret-of-100-commitment-and-success-is-10-behaviors",
         "tags": [
            "motivation"
         ],
         "image": "blog/the-secret-of-100-commitment-and-success-is-10-behaviors-logo.png",
         "description": "The bigger your future, the better your present.",
         "body": "<h1 class=\"mb-3\"> The bigger your future, the better your present. </h1>\n<p>Today's motivation by <a href=\"https://medium.com/@benjaminhardy\" alt target=\"_blank\" rel=\"noopener noreferrer\">Benjamin Hardy </a></p>\n<p><img src=\"/images/blog/the-secret-of-100-commitment-and-success-is-10-behaviors-logo.png\" alt class=\"img-fluid\" /></p>\n<p>\n    When you have a specific future you are striving for and committed to, your present circumstances and experiences take on a new meaning. You’re able to convert your experience — even your painful experience — into learning, growth, and change. If you don’t have a future you’re actively striving for, then you can’t actively convert your experience into learning. \n</p>\n<p>\n    When you’re committed to a bigger future, your present becomes far less predictable. Rather than living within the confines of your narrow comfort zone, you begin embracing uncertainty. You begin stepping outside of your “known” world and begin approaching the world of your Future Self.\n</p>\n<p>\n    Below skills can achieve incredible things in your life.\n</p>\n<h2 class=\"mb-3 mt-5\">1. Define Your Future Self (No More Than 3 Years Out)</h2>\n<p>\n    Psychologists call active learning “deliberate practice.” You can’t engage in such “practice” or learning unless you have a very clear goal. You need a clear goal and also a clear future identity, as the person you plan to become.\n</p>\n<h2 class=\"mb-3 mt-5\">2. Start Getting All of the Information You Possibly Can</h2>\n<p>\n    Once you’ve defined your own future self, you need to start getting information. You need to develop a clear goal and plan to become your future self.\n</p>\n<p><img src=\"/images/blog/the-secret-of-100-commitment-and-success-is-10-behaviors-1.png\" alt class=\"img-fluid\" /></p>\n\n<h2 class=\"mb-3 mt-5\">3. Tell Everyone About Your Plan</h2>\n<p>\n    It takes courage to be open about your goals. It takes courage to be open about your failings.\n</p>\n<p>\n    Mr. Rogers said: “Anything that’s human is mentionable, and anything that is mentionable can be more manageable. When we can talk about our feelings, they become less overwhelming, less upsetting, and less scary. The people we trust with that important talk can help us know that we are not alone.”\n</p>\n<p>\n    It means that when you become more open and honest as a person, life becomes far more manageable. You stop needlessly suffering internally about unfulfilled dreams or former hurts. You move forward. And that’s the freaking key! Moving forward! That’s where we are about here. Moving forward as powerfully and authentically as possible.\n</p>\n\n<h2 class=\"mb-3 mt-5\">4. Invest at the Level of Your Future Self</h2>\n<p>Investing in yourself, then, is also about your network of relationships. You are only as good as your network. The more successful you become, the more life becomes about “Who” instead of “How.” The worst thing you could do is trying “going it alone” on your goals. Going it alone is a demonstration of a lack of commitment.\n</p>\n<p><img src=\"/images/blog/the-secret-of-100-commitment-and-success-is-10-behaviors-2.png\" alt class=\"img-fluid\" /></p>\n<h2 class=\"mb-3 mt-5\">5. Eliminate Everything that Discourages Your Future Self</h2>\n<p>\n    Stepping out of the comfort zone of your current persona and subconscious is risky. It involves uncertainty and courage. Given this fact, you need the stability and support of encouraging friends and loved ones.\n</p>\n<p>\n    Beyond relationships, you need to remove the information and experiences that are triggering your current and former selves. Zig Ziglar said, “Your input determines your outlook. Your outlook determines your output, and your output determines your future.”\n</p>\n<h2 class=\"mb-3 mt-5\">6. Write in Your Journal Every Morning About Your Future Self</h2>\n<p>\n    There’s a lot going on in your world. Taking 10–20 minutes every day, ideally at the start of the day, to express your thoughts and feelings is how you reduce your internal sufferings and make life manageable.\n</p>\n<p>\n    Writing in your goals every day is essential to optimizing your life. If you want the best possible results, write about your goals and dreams every day. When you’re struggling emotions, write about your emotions. By giving them form, you’ll stop suffering and be enabled to move forward.\n</p>\n<p><b>Be incredibly honest with yourself.</b></p>\n<h2 class=\"mb-3 mt-5\">7. Define 1–3 Actions You Can Make Daily Toward Your Goal</h2>\n<p>There is a fundamental difference between urgent and important activities. Life is filled with urgencies. But your future self is in the “important” category. Anything that is “important” can easily be procrastinated and put off. </p>\n<p><img src=\"/images/blog/the-secret-of-100-commitment-and-success-is-10-behaviors-3.png\" alt class=\"img-fluid\" /></p>\n<p>\n    When you’re focused on your future self, you don’t need a big to-do list. Instead, you need a focused and short list. Just 1–3 items each day. Count your wins. Make meaningful progress. \n</p>\n<h2 class=\"mb-3 mt-5\">8. “Eat the Frog” Every Single Day</h2>\n<p>\n    If you’re committed to your dreams, make progress on them before you do anything else. Even if that means you must get up early. If you make progress toward your “important” dreams, you’ll be a better person throughout your day. You’ll be happier in your relationships. You’ll have better energy. You’ll be congruent. You’ll be hopeful and happy. You’ll energize others in a powerful way. You’ll get out of your head with feelings of regret. Thus, you’ll be more present.\n</p>\n<p><b>If you eat the frog every morning, you will live your dreams.</b></p>\n<h2 class=\"mb-3 mt-5\">9. Report Your Progress Daily to Your Accountability Partner (This Takes 1 Minute/Day)</h2>\n<p>The above picture turns accountability into a single text message each evening. You report how you did on your Big-3(win/out of all) and list your Big-3 for the next day. There’s an added benefit to listing your Big-3 the night before, and that’s that you get to go to bed with a purpose.</p>\n<p>\n    By going to bed with a purpose, you can wake up motivated and with a plan. This allows you to avoid needless decision fatigue the next morning.\n</p>\n\n\n<h2 class=\"mb-3 mt-5\">10. Completely Unplug Every Single Day</h2>\n<p>\n    Last but not least, you need to fully “unplug” for large intervals throughout your day. There’s a lot of research on Psychological detachment from work. True psychological detachment occurs when you completely refrain from work-related activities and thoughts during non-work time.\n</p>\n<p>\n    Research has shown that only 16 percent of respondents reported getting creative insight while at work. Ideas generally came while the person was at home or in transportation, or during recreational activity<b>(Happens with me most of the time)</b>. “The most creative ideas aren’t going to come while sitting in front of your monitor,” says Scott Birnbaum, a vice president of Samsung Semiconductor.\n</p>\n<p>\n    The reason for this is simple. When you’re working directly on a task, your mind is tightly focused on the problem at hand (i.e., direct reflection). Conversely, when you’re not working, your mind loosely wanders (i.e., indirect reflection).\n</p>\n<p>\n    Creativity is a skill you can develop. As is clarity and insight. You’ll get much more when you take time to rest and recover. You need to fully unplug and be actively engaged in other areas of your life.\n</p>\n\n<p>\n    I wrote this post inspired by Benjamin Hardy's post on Medium. You can check full post <a href=\"https://medium.com/@benjaminhardy/ready-to-commit-100-to-your-dreams-here-are-the-10-steps-14e4c01c71ec\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.\n</p>",
         "published": true,
         "created": "2020-05-01T03:38:55.541Z",
         "updated": "2020-05-01T03:38:55.541Z"
      },
      {
         "id": 6,
         "title": "React Native tutorial for beginners using Native CLI",
         "url": "react-native-tutorial-for-beginners-using-native-cli",
         "tags": [
            "react-native",
            "tutorial"
         ],
         "image": "blog/react-native-tutorial-for-beginners-using-native-cli-logo.png",
         "description": "Best React Native Tutorial without Expo.",
         "body": "<h1 class=\"mb-3\"> Best React Native Tutorial without Expo CLI.</h1> <p><img src=\"/images/blog/the-secret-of-100-commitment-and-success-is-10-behaviors-logo.png\" alt class=\"img-fluid\" /></p> <p> I wanted to learn mobile application. I went through many tutorials to find perfect programming language to create mobile application. In the end, I was in dilemma between react and flutter. Finally I decided to move on to start learning react native because recently I converted my HTML site to react. </p> <p> Now, it's time to find right tutorial to learn flow, architecture and basics. I looked into youtube, many blogs, official document as well. But, I didn't find any right tutorial. </p> <p> Many tutorials are using the Expo that I don't want to include in my application. Basically, there are two ways to build native application in react. 1) Expo CLI 2) Native CLI </p> <h2 class=\"mb-3 mt-5\">Expo vs Native</h2> <p> If you are new to mobile development, the easiest way to get started is with Expo CLI. Expo is a set of tools built around React Native and, while it has many features, the most relevant feature for us right now is that it can get you writing a React Native app within minutes. You will only need a recent version of Node.js and a phone or emulator. </p> <p> If you are already familiar with mobile development, you may want to use React Native CLI. It requires Xcode or Android Studio to get started. If you already have one of these tools installed, you should be able to get up and running within a few minutes. If they are not installed, you should expect to spend about an hour installing and configuring them. </p> <p> Overall, your final application size will be at least 20 mb using Expo CLI. So, I don't want that. </p> <p> As I have searched many tutorials to create application using Native-CLI but I can't find easily. Because, everyone suggests beginner to start learning using Expo CLI. </p> <p> However, I decided to learn directly Native CLI. Hence, I dig into it more. In the end, I found really good tutorial to create the calculator app. You can start it from <a href=\"https://kylewbanks.com/blog/react-native-tutorial-part-1-hello-react\" target=\"_blank\" rel=\"noopener noreferrer\">here.</a> </p> <p> Also, there is many more tutorials shared by <a href=\"https://github.com/jondot\" target=\"_blank\" rel=\"noopener noreferrer\">Jondot</a> (github user). Here is the repository <a href=\"https://github.com/jondot/awesome-react-native\" target=\"_blank\" rel=\"noopener noreferrer\">Awesome React Native</a> </p> <p> Best wishes to you from KePy :). </p>",
         "published": true,
         "created": "2020-05-02T03:43:30.418Z",
         "updated": "2020-05-02T03:43:30.418Z"
      },
      {
         "id": 7,
         "title": "React Native tutorial for beginners (Part-2)",
         "url": "react-native-tutorial-for-beginners-part-2",
         "tags": [
            "react-native",
            "tutorial"
         ],
         "image": "blog/react-native-tutorial-for-beginners-part-2-logo.png",
         "description": "Mobile App Onboarding with React Native",
         "body": "<h1 class=\"mb-3\"> Mobile App Onboarding with React Native</h1>\n<p><img src=\"/images/blog/react-native-tutorial-for-beginners-part-2-logo.png\" alt class=\"img-fluid\" /></p>\n<p>\n    After creating calculator app in react native. One can understand basic architecture, classes, libraries, intallation of react native by creating calculator app. Now, it's time to work on real application.\n</p>\n<h2 class=\"mb-3 mt-5\">Application Onboarding</h2>\n<p>\n    First rule of mobile application is user can understand your application features. App onboarding is key for one core reason: if users don’t understand your app, they won’t use it. The onboarding process is a user’s first impression of your app, and when designed correctly, increases the likelihood of successful adoption. When a user launches your app for the first time, the onboarding process reinforces your app’s value and provides instructions that highlight key benefits and features. A strong onboarding process is essential to your app’s success.\n</p>\n<p>\n    I found good tutorial for creating mobile application onboarding. You can find whole tutorial <a href=\"https://rationalappdev.com/complete-guide-to-mobile-app-onboarding-with-react-native/#what-are-we-building\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>. Tutorial is written by Konstantin Shkut. The final app will look like below.\n</p>\n<p><img src=\"/images/blog/react-native-tutorial-for-beginners-part-2-1.gif\" alt class=\"img-fluid\" /></p>\n<h2 class=\"mb-3 mt-5\">Expo vs Native</h2>\n<p>\n    You can get the source code of the app using git or directly on github. Github repo link: <a href=\"https://github.com/rationalappdev/onboarding.git\" target=\"_blank\" rel=\"noopener noreferrer\">https://github.com/rationalappdev/onboarding.git</a> By following this tutorial, you will learn how to build an on boarding flow for your app. And you’re not limited to screens with some copy, icons or images. You can also have instructions on how to use your app, input fields, and some other sorts of customization controls. There are various ways of doing onboarding. It’d be a good idea to look at the apps with great onboarding to see what they do and find out what would work the best for your app.\n</p>\n<p> Best wishes to you from KePy :). </p>",
         "published": true,
         "created": "2020-05-05T04:12:08.371Z",
         "updated": "2020-05-05T04:12:08.371Z"
      },
      {
         "id": 8,
         "title": "Problems for React Native beginners",
         "url": "problems-for-react-native-beginners",
         "tags": [
            "react-native",
            "tutorial",
            "bug"
         ],
         "image": "blog/problems-for-react-native-beginners-logo.png",
         "description": "Here's the common problem that you might face in react-native",
         "body": "<h1 class=\"mb-3\"> Here's the common problems that you might face in react-native </h1> <p> I hope you have just started to learning mobile app development using react native. There are lots of challenges to adopting the new technology. I will write about which issue took my much time to solve. </p> <p><img src=\"/images/blog/problems-for-react-native-beginners-logo.png\" alt class=\"img-fluid\" /></p> <h2 class=\"mb-3 mt-5\">Synchronisation Problem</h2> <p> It's not easier to complete the installation of new technology. As you know, developers are keep trying to solve this problem. However, each solution creates the new problem. In react native, you can simply install any new libraries using the npm but there are lots of problem behind this. Developers keep introduces the new features, solve previous bugs, improving architecture etc. </p> <p> In result, they keep update the versions of the libraries and we have to use latest version of the library. But, when you update only one library then it directly affects the other libraries that depended on it. You will find lots of issues about it in the Github. </p> <h2 class=\"mb-3 mt-5\">Multiple commands produce</h2> <p> The common problem that everyone faces in the react native is <b>Multiple commands produce</b>. As I was working on <a href=\"#/blog/react-native-tutorial-for-beginners-part-2\">mobile onboarding</a> feature. So, I have to use react-native-vector-icons library to include icons in my project. </p> <p> But, this libary includes fonts library that already comes with react native original libary as well as with other libraies (ex: react-native-base, galio-framework etc). So, when you build your project it clashes with other libray and leads to <b>build fail</b>. </p> <h2 class=\"mb-3 mt-5\">Full Error</h2> <p> <figure> <pre><code> error: Multiple commands produce &apos;/Users/salih/Desktop/Github/Kopgitv1/ios/build/Build/Products/Debug-iphonesimulator/Kopgitv1.app/Entypo.ttf&apos;: \n\n1) Target &apos;Kopgitv1&apos; (project &apos;Kopgitv1&apos;) has copy command from &apos;/Users/salih/Desktop/Github/Kopgitv1/node_modules/native-base/Fonts/Entypo.ttf&apos; to &apos;/Users/salih/Desktop/Github/Kopgitv1/ios/build/Build/Products/Debug-iphonesimulator/Kopgitv1.app/Entypo.ttf&apos; \n\n2) Target &apos;Kopgitv1&apos; (project &apos;Kopgitv1&apos;) has copy command from &apos;/Users/salih/Desktop/Github/Kopgitv1/node_modules/react-native-vector-icons/Fonts/Entypo.ttf&apos; to &apos;/Users/salih/Desktop/Github/Kopgitv1/ios/build/Build/Products/Debug-iphonesimulator/Kopgitv1.app/Entypo.ttf&apos;</code></pre> </figure> </p> <p> I almost spent one day to solve this problem. I have reinstalled all the libraries many times to catch the original problem. For that, I have created whole new project from the scratch and caught the issue. After that, I was looking for the solution. Many tutorials are said to unlink react-native-vector-icons library but still it's only a quick fix. I got many github and stackoverflow issue links but still no solution worked. </p> <p> Finally, one article from gitmemory saved me. There solution worked for me. You can check whole post <a href=\"https://gitmemory.com/issue/facebook/react-native/20492/557944837\" target=\"_blank\" rel=\"noopener noreferrer\">here.</a> However, I'm attaching solution if you can't read the post. </p> <p><figcaption> For newbies like me: you need to edit the file </figcaption><pre><code>&lt;PROJECT_FOLDER&gt;/ios/&lt;PROJECT_NAME&gt;.xcodeproj/project.pbxproj</pre></code> </p> <p>Then delete all the font lines (files ending in .ttf) (You have to delete lines from inputPaths and outputPaths)</p> <p><figcaption> inputPaths looks like this </figcaption><pre><code>\ninputPaths = (\n&#x9;&#x9;&#x9;&#x9;&quot;${PODS_ROOT}/Target Support Files/Pods-JobApp-JobAppTests/Pods-JobApp-JobAppTests-resources.sh&quot;,\n&#x9;&#x9;&#x9;&#x9;&quot;${PODS_ROOT}/../../node_modules/react-native-vector-icons/Fonts/AntDesign.ttf&quot;,\n&#x9;&#x9;&#x9;&#x9;&quot;${PODS_ROOT}/../../node_modules/react-native-vector-icons/Fonts/Entypo.ttf&quot;,\n \\.......and so on.(In above case last two lines will be removed) \n); </pre></code></p> <p> If this still don't work for you, you can check following tutorials that have best solution that worked for the most. </p> <p> <a href=\"https://github.com/oblador/react-native-vector-icons/issues/1074\" target=\"_blank\" rel=\"noopener noreferrer\">1) [Xcode 11] 'Multiple commands produce' error when building with new Xcode build system</a> </p> <p> <a href=\"https://stackoverflow.com/questions/50718018/xcode-10-error-multiple-commands-produce\">2) Xcode 10 Error: Multiple commands produce </a> </p> <p> <a href=\"https://github.com/facebook/react-native/issues/20492\" target=\"_blank\" rel=\"noopener noreferrer\">3) 'Multiple commands produce' error when building with new Xcode build system</a> </p> <p>Hope this article helped you. Best wishes to you from KePy :). </p>",
         "published": true,
         "created": "2020-05-06T03:42:51.274Z",
         "updated": "2020-05-06T03:42:51.274Z"
      },
      {
         "id": 9,
         "title": "React AsyncStorage, Redux Guide for Beginners",
         "url": "react-redux-guide-for-beginners",
         "tags": [
            "react-native",
            "tutorial",
            "react-redux",
            "redux-persist"
         ],
         "image": "blog/react-redux-guide-for-beginners-logo.png",
         "description": "Understanding Redux: How it can be used in React-Native?",
         "body": "<h1 class=\"mb-3\"> Understanding AsyncStorage, Redux: Why and How it can be used in React-Native? </h1> <h2 class=\"mb-3 mt-5\">Why Redux?</h2> <p> First, we have to understand why redux is needed in our application. Recently, I completed mobile onboarding application. After that, user moved to the homepage. However, when user refreshed the application; mobile onboarding screens again shown to the user. The purpose of mobile onboarding screen to show main features of the application to the user---This should be one time only--. </p> <p><img src=\"/images/blog/react-redux-guide-for-beginners-logo.png\" alt class=\"img-fluid\" /></p> <h2 class=\"mb-3 mt-5\">AsyncStorage</h2> <p> As you know, react native manages state data component wise and you need to store boolean flag (ex. userOnboardingCompleted?) to create condition on mobile onboarding screens. So, I looked for the local storage and found well known library \"AsyncStorage\" for react-native. This thing worked for me. <b>Do not use react-native core component for that as it is deprecated in new versions.</b> Follow this tutorial to start with <a href=\"https://github.com/react-native-community/async-storage\" target=\"_blank\" rel=\"noopener noreferrer\">AsyncStorage</a> and trust me it is very easy part. </p> <h2 class=\"mb-3 mt-5\">Redux</h2> <p> Now, I want to use apiToken in every component. You might be thinking: it is easy to get values from the local storage using AsyncStorage getItem function. But, it is bad designing because everytime your application fetch value from the storage so it takes much time to render new pages. </p> <p> This time redux come into the picture. Redux is a state manager. In other way, it is state management libraries beautifully keep logic and behaviours abstracted away from the UI. So, your application reads local storage data one time and stores it into the memory using state. Now, redux passes this data to every component so it will save lot of time. </p> <h2 class=\"mb-3 mt-5\">Challenges</h2> <p> Learning redux is quite difficult as you have to learn many new things. When I approached Redux for the first time today I was confused. There is too much terminology: action, reducer, middleware. But on top of that it wasn't clear to me how were all the moving parts glued together? There were some minions or what? In Redux there are no minions (unfortunately). </p> <h2 class=\"mb-3 mt-5\">Solution</h2> <p> However, it is not that hard if you follow this tutorial completely. </p> <p> <a href=\"https://css-tricks.com/understanding-how-reducers-are-used-in-redux/\" target=\"_blank\" rel=\"noopener noreferrer\">1) https://css-tricks.com/understanding-how-reducers-are-used-in-redux/</a> </p> <p> <a href=\"https://www.youtube.com/watch?v=KcC8KZ_Ga2M\" target=\"_blank\" rel=\"noopener noreferrer\">2) #1 WTF is Redux? | React Native App | Redux Tutorial</a> </p> <p> Above two tutorials are enough to understand the react redux but you have to do practice together and understand concept thouroughly. </p> <p>Thanks for reading and stay tuned on this blog! Happy coding!!!!!</p>",
         "published": true,
         "created": "2020-05-07T08:46:11.521Z",
         "updated": "2020-05-07T08:46:11.521Z"
      },
      {
         "id": 10,
         "title": "How to persist Redux State to the Local Storage?",
         "url": "how-to-persist-redux-state-to-the-local-storage",
         "tags": [
            "react-native",
            "tutorial",
            "react-redux",
            "redux-persist"
         ],
         "image": "blog/how-to-persist-redux-state-to-the-local-storage-logo.png",
         "description": "Time saver library to manage redux state data locally.",
         "body": "<h1 class=\"mb-3\"> Time saver library to manage redux state data locally. </h1> <p> Redux is a great library which solves many issues related to keeping a state of an application. Thanks to it, we no longer have to worry about the hierarchy of components. The central store can be accessed from every component to get the current state of any aspect of an application. </p> <p><img src=\"/images/blog/how-to-persist-redux-state-to-the-local-storage-logo.png\" alt class=\"img-fluid\" /></p> <h2 class=\"mb-3 mt-5\">Local Storage</h2> <p> However, sometimes you may need to store redux state data locally. For ex, storing user profile name, user name can be used multiple components. As per current understanding, you will read and write profile name from local storage--AsyncStorage--. </p> <h2 class=\"mb-3 mt-5\">Redux-Persist</h2> <p> But, you can do this using redux persist library. Redux-persist is a simple library; it’s a wrapper for a store that automatically saves a redux state to the storage. Also, you can define where it should save data, and available options depend on a platform; you can choose localStorage, sessionStorage, localForage, AsyncStorage or we can even integrate it with the custom storage. In future, if you want to change local storage then you have to <b>change in only one file.</b> </p> <p> There are many configuration you can give to the library and it makes your life very easy. Suppose, you don't want to store every data in the local storage. So, there is a option to provide <b>whitelist</b> and <b>blacklist</b> components. Blacklist components navigation will not be persisted--oppose to whitelist--. </p> <h2 class=\"mb-3 mt-5\">Tutorial</h2> <p> If you think, it is useful in your application. You can follow below tutorials to get complete understanding about redux persist. </p> <p> <a href=\"https://www.youtube.com/watch?v=J3aJNTqeXMw\" target=\"_blank\" rel=\"noopener noreferrer\">React Native Redux Persist [ How to use redux persist ]</a> </p> <p> <a href=\"https://blog.reactnativecoach.com/the-definitive-guide-to-redux-persist-84738167975\" target=\"_blank\" rel=\"noopener noreferrer\">The Definitive Guide to Redux Persist</a> </p> <p> I followed above two tutorials first time to get started with redux persist library. Now, you don't have to communicate to local storage directly. </p> <p>Thanks for reading and stay tuned on this blog! Happy coding!!!!!</p>",
         "published": true,
         "created": "2020-05-07T21:50:25.142Z",
         "updated": "2020-05-07T21:50:25.142Z"
      },
      {
         "id": 11,
         "title": "Hosting react blog to Github Pages",
         "url": "hosting-react-blog-to-github-pages",
         "tags": [
            "react",
            "tutorial",
            "github-pages"
         ],
         "image": "blog/hosting-react-blog-to-github-pages-logo.png",
         "description": "How to deploy React App to GitHub Pages?",
         "body": "<h1 class=\"mb-3\"> How to deploy React App to GitHub Pages? </h1> <p> Recently, I have converted my static website to dynamic using react. Now, it's time to host it on Github Pages. You might know what is Github Pages so you can skip next paragraph. </p> <p><img src=\"/images/blog/hosting-react-blog-to-github-pages-logo.png\" alt class=\"img-fluid\" /></p> <h2 class=\"mb-3 mt-5\">Github Pages</h2> <p> Github is a company that hosts \"code repositories\", collections of code for projects. Many of the code repositories are \"open source\", which means they're publicly available for the whole world to browse. Well, Github has a feature called Github Pages, which makes it easy and free for you to create a multi-file website hosted at yourusername.github.io. </p> <p> I already hosted my static website on the Github pages so I just have to change the repository. If you want to host your react app from the scratch you can follow this latest <a href=\"https://dev.to/yuribenjamin/how-to-deploy-react-app-in-github-pages-2a1f\" target=\"_blank\" rel=\"noopener noreferrer\">tutorial.</a> </p> <h2 class=\"mb-3 mt-5\">Copying branch from one repository to another, preserving git history</h2> <p> In the multi-repository project structure, its only a matter of time when you’ll want to refactor some files from one project to another. I was maintaining my static website on one repository and created new react app in new repository. Now, I have to copy all previous branches to new branches as it doesn't worth to leave old repository. However, it can be useful in future so it's good idea to take backup. </p> <p> Copying branches from another repository is quite easy task. You just have to follow below steps. </p> <h3 class=\"mb-3 mt-5\">Repository url</h3> <p> <pre> <code> origin: https://github.com/kepy97/portfolio.git #::Your original repository \n remote: https://github.com/kepy97/old_portfolio.git #::Repository that you want to copy branches </code> </pre> </p> <h3 class=\"mb-3 mt-5\">Copy all branch from another repository</h3> <p> <pre><code>$ git clone https://github.com/kepy97/portfolio.git #::clone origin repo \n$ cd git-test\n$ git remote add old_repo https://github.com/kepy97/old_portfolio.git #::add as a remote branch </code> </pre> </p> <h3 class=\"mb-3 mt-5\">show all remote repo</h3> <p> <pre> <code> $ git remote -v \n html5 https://github.com/kepy97/old_portfolio.git (fetch) \n html5 https://github.com/kepy97/old_portfolio.git (push) \n origin https://github.com/kepy97/portfolio.git (fetch) \n origin https://github.com/kepy97/portfolio.git (push) </code> </pre> </p> <h3 class=\"mb-3 mt-5\">fetch remote repo data and show branches</h3> <p> <pre> <code> $ git fetch html5 \n $ git branch -a \n * master \n remotes/old_repo/master \n remotes/old_repo/blog \n remotes/origin/HEAD \n remotes/origin/master </code> </pre> </p> <h3 class=\"mb-3 mt-5\">Copy old_repo/blog branch to origin repository</h3> <p> <pre> <code> $ git checkout -b old_site_blog old_repo/blog </code> </pre> old_site_blog = \"New branch name in original repo\" old_repo/blog = \"the branch name that you want to copy\" </p> <h3 class=\"mb-3 mt-5\">push old_site_blog to origin server</h3> <p> <pre> <code> $ git push origin old_site_blog </code> </pre> </p> <p> Now, you can see all your <b>old_repo_blog</b> copied into origin branch online. If you want to copy another branch then follow last two steps again. </p> <h2 class=\"mb-3 mt-5\">Many of you might want to use Custom Domain in react app</h2> <p> To use custom domain, you have to setup github repository and change your DNS to github servers. You can follow this pretty forward tutorial <a href=\"https://help.github.com/en/github/working-with-github-pages/managing-a-custom-domain-for-your-github-pages-site\" target=\"_blank\" rel=\"noopener noreferrer\">here.</a> </p> <p> However, when you setup for react application you have to provide CNAME in github repository. But, when you run <b>npm run deploy</b> command, it overrides/delete the CNAME file. So, everytime you have to update the CNAME online. There's a open issue on github <a href=\"https://github.com/tschaub/gh-pages/issues/127\" target=\"_blank\" rel=\"noopener noreferrer\">gh-pages -d dist overwrites custom domain</a> </p> <p> There's a solution for automatic CNAME changes. You just have to add CNAME file in /public directory. create-react-app will include all /public directory files in the build output. </p> <p>Hope this tutorial helped you! Happy coding!!!!!</p>",
         "published": true,
         "created": "2020-05-10T21:25:49.984Z",
         "updated": "2020-05-10T21:25:49.984Z"
      },
      {
         "id": 12,
         "title": "How to run android emulator without opening Android Studio?",
         "url": "how-to-run-android-emulator-without-opening-android-studio",
         "tags": [
            "react-native",
            "android-studio"
         ],
         "image": "blog/how-to-run-android-emulator-without-opening-android-studio-logo.png",
         "description": "Start the emulator from the command line",
         "body": "<h1 class=\"mb-3\"> Start the emulator from the command line in MAC OS </h1> <p> I'm developing mobile application in react-native. Manytimes I want to test my application in android device. It's very hard to test application by building apk and run on physical device. If you are developing application in react-native or any cross platform, you might want to run application on iOS as well android device. </p> <p> It's easy to test application in ios emulator because react-native run-ios can directly opens the emulator in MAC OS. However, react-native run-android command can't open android emulator. You have to open android studio to start the emulator. </p> <p><img src=\"/images/blog/how-to-run-android-emulator-without-opening-android-studio-logo.png\" alt class=\"img-fluid\" /></p> <h2 class=\"mb-3 mt-5\">Solution</h2> <p> You can start the emulator using command line. Firsly, your system have installed android studio. Then, go to the android sdk folder. Default installation path in MAC os is: </p> <p> <pre> <code> /Users/yoursystemname/Library/Android/sdk/emulator </code> </pre> </p> <p> Change your system name in above path. After that, <pre> <code> emulator -list-avds </code> </pre> OR <pre> <code> ./emulator -list-avds </code> </pre> </p> <p> Then copy the <b>avd_name</b> that you want to start. After that run following command: <pre> <code> emulator @avd_name </code> </pre> OR <pre> <code> ./emulator @avd_name </code> </pre> </p> <p><img src=\"/images/blog/how-to-run-android-emulator-without-opening-android-studio-1.png\" alt class=\"img-fluid\" /></p> <p> Now, your emulator will start. Many people find this problem:<a href=\"https://stackoverflow.com/questions/26483370/android-emulator-error-message-panic-missing-emulator-engine-program-for-x86\" target=\"_blank\" rel=\"noopener noreferrer\">\"PANIC: Missing emulator engine program for 'x86' CPUS.\"</a> In that case, you just have to go to the emulator directory instead of toools. If you face any problem then check above screenshot for more details. </p> <p> Hope this article helped you. Best wishes to you from KePy :). </p> ",
         "published": true,
         "created": "2020-05-10T23:18:48.095Z",
         "updated": "2020-05-10T23:18:48.095Z"
      },
      {
         "id": 13,
         "title": "Surviving Finals Week",
         "url": "surviving-finals-week",
         "tags": [
            "masters",
            "exams"
         ],
         "image": "blog/surviving-finals-week-logo.png",
         "description": "Final Week of semester Spring 2020",
         "body": "<h1 class=\"mb-3\"> Final Week of semester Spring 2020 </h1> <p> This is second semester of my masters at <a href=\"https://uwm.edu/\" target=\"_blank\" rel=\"noopener noreferrer\">University of Wisconsin-Milwaukee</a>. After getting down a routine during the first couple weeks of college, semester will start to move quickly. Weeks go fast because there is a lot of work assigned in class on top of tests and activities. </p> <p> In addition, this is the end of the most unusual spring semester in memory. Half semester education shifted to online. There were many challenges but time spent very quickly. During this stressful week, there are exams in many courses. And the exam percentages are high in final grades. </p> <p><img src=\"/images/blog/surviving-finals-week-logo.png\" alt class=\"img-fluid\" /></p> <p> Time management is extremely important during finals week. All exams gonna be online this semester. Also, there is project submission in my course that will due after the exam. So, I wish all of my friends to All the very best for the exam. </p> <p> Best wishes to you from KePy :). </p> ",
         "published": true,
         "created": "2020-05-12T16:51:50.541Z",
         "updated": "2020-05-12T16:51:50.541Z"
      },
      {
         "id": 14,
         "title": "Feelings after writing final exams",
         "url": "feelings-after-writing-final-exams",
         "tags": [
            "masters",
            "exams"
         ],
         "image": "blog/feelings-after-writing-final-exams-logo.png",
         "description": "The incredible period after writing an exam.",
         "body": "<h1 class=\"mb-3\">The incredible period after writing an exam.</h1> <p> The mood after the exam totally depends on how your exams went. When the exams paper is done properly well, then the mood is already good and you have soo many ideas for you to do in the vacation. But when sometimes paper is just like worse then it feels very very bad. You get constant thought about it. </p> <h2 class=\"mb-3 mt-5\">My experience</h2> <p> Today, my exams are completed for Spring 2020. Exam paper was very good. I got all the answers. Now, I have almost three and a half month summer vacation. I have lots of things in my mind to do but I'm feeling strong relief and excitement. </p> <p> Today, the weather is very good outside. So for relaxation, I'm sitting outside in the backyard of my home and writing this post. Enjoying the nature beauty!! </p> <p><img src=\"/images/blog/feelings-after-writing-final-exams-logo.png\" alt class=\"img-fluid\" /></p> <p> Hope you are doing great in this time. Best wishes to you from KePy :). </p> ",
         "published": true,
         "created": "2020-05-15T21:49:38.345Z",
         "updated": "2020-05-15T21:49:38.345Z"
      },
      {
         "id": 15,
         "title": "Scroll to section on click in React",
         "url": "scroll-to-section-on-click-in-react",
         "tags": [
            "react",
            "tutorial"
         ],
         "image": "blog/scroll-to-section-on-click-in-react-logo.png",
         "description": "How to Scroll to a List Item in React? ",
         "body": "<h1 class=\"mb-3\"> How to Scroll to a List Item in React? </h1>\n<p>A brief tutorial which shows you use cases on how to scroll to an item within a list of items in a React List Component. Also, this tutorial shows smooth scrolling. Smooth scrolling is when instead of clicking on a button and being instantly taken to a different part of the same page, the user is navigated there via a scroll animation. It’s one of those subtle UI features on a site that makes an aesthetic difference.</p>\n<p>\n    There are many tutorials you can see on the internet. But, most of the solutions are not working or you face somekind of the warning or error. That's because of the many functionality deprecated in latest react versions. I will show you latest method to smooth scroll in your website(Still, please check latest method on <a href=\"https://reactnative.dev/\" target=\"_blank\" rel=\"noopener noreferrer\">react official website</a> to check this method does not deprecated(May 2020)). \n</p>\n<p><img src=\"/images/blog/scroll-to-section-on-click-in-react-logo.png\" alt\n        class=\"img-fluid\" /></p>\n<h2 class=\"mb-3 mt-5\">Let's jump into the solution</h2>\n<p>\n    Create global variable in your component.\n</p>\n<figure>\n    <pre><code>const ref = React.createRef();</code></pre>\n</figure>\n<p>\n    Now use <b>ref</b> variable in your tag that you wanted to focus after scrolling.\n</p>\n<figure>\n    <pre><code>&lt;section className=&quot;ftco-section&quot; ref={ref}&gt;</code></pre>\n</figure>\n<p>\n    The tag can be anything from div, section, a, span to your manual component. Now create function that handles the scrolling.\n</p>\n<figure>\n    <pre><code>handleScrolling() {\n        ref.current.scrollIntoView({\nbehavior: 'smooth',\n            block: 'start',\n        });\n    }</code></pre>\n</figure>\n<p>\n    Next, you just have to call this function and it will smoothly scroll to the section. For ex, I want to scroll when user clicks on the button so code will look like this:\n</p>\n<figure>\n    <pre><code>&lt;button type=&quot;button&quot; onClick={this.handleClick}&gt;\n        Scroll Into View\n      &lt;/button&gt;</code></pre>\n</figure>\n<p>\n    Now, your scrolling works fine. So how does this work? Let's get into the details: In order to scroll to the section, we added a button element with a onClick handler. Also section receives a ref object for accessing the DOM node later. Then in the click handler of the button, we can use the reference of the DOM node to use the scrollIntoView API. In our case, we are using a configuration object to make it a smooth scroll to the start of the list item.\n</p>\n<p>\n    Still any doubt or want to create multiple reference, checkout <a href=\"https://www.robinwieruch.de/react-scroll-to-item\" target=\"_blank\" rel=\"noopener noreferrer\">this</a> really cool tutorial by Robin that will help you. \n</p>\n<p>\n    If you want to test it, checkout the <a href=\"https://codesandbox.io/s/github/the-road-to-learn-react/react-list-component/tree/master/?fontsize=14&file=/src/components/ListScrollToItemOutside.js:1168-1179\" target=\"_blank\" rel=\"noopener noreferrer\">Demo on codesandbox.</a>\n</p>",
         "published": true,
         "created": "2020-05-21T06:03:11.650Z",
         "updated": "2020-05-21T06:03:11.650Z"
      },
      {
         "id": 16,
         "title": "Strangest bug that I never thought about it",
         "url": "strangest-bug-that-i-never-thought-about-it",
         "tags": [
            "react",
            "bug"
         ],
         "image": "blog/strangest-bug-that-i-never-thought-about-it-logo.png",
         "description": "Apple thinks and works differently. This causes inconsistency and inconvenience sometimes..",
         "body": "<h1 class=\"mb-3\">As you know, Apple thinks and works differently. This causes inconsistency and inconvenience sometimes.</h1> <p> Apple ---The idea of thinking different doesn’t just stop with hardware design and user interface, Even the internal working is designed differently. One such thing happened in the project which I was working. </p> <p><img src=\"/images/blog/strangest-bug-that-i-never-thought-about-it-logo.png\" alt class=\"img-fluid\" /></p> <h2 class=\"mb-3 mt-5\">Project Information</h2> <p> I was working on my web application that built using ReactJS. So, the issue is when I shot a picture having the iphone vertically the picture gets saved in iphone. When I viewed it in iphone or mac it shows properly in portrait view, but when it is uploaded into my web application it was turning into landscape view with wrong orientation. </p> <p> I have uploaded to my blog post: <a href=\"#/blog/feelings-after-writing-final-exams\">Feelings after writing final exams</a>. So, I took photo from my iPhone and uploaded to my website. After posting it, I checked it on my laptop. At that time, post was looking wonderful. Check out below image: </p> <p><img src=\"/images/blog/strangest-bug-that-i-never-thought-about-it-1.png\" alt class=\"img-fluid\" /></p> <h2 class=\"mb-3 mt-5\">After somedays</h2> <p> One of my friend checking my posts and he said one of the image is not showing properly. I again looked into my laptop and it was showing perfectly. But, when he said he is checking in the iPhone so I looked into it and found this: </p> <p><img src=\"/images/blog/strangest-bug-that-i-never-thought-about-it-2.png\" alt class=\"img-fluid\" /></p> <h2 class=\"mb-3 mt-5\">Actual Problem: EXIF</h2> <p> EXIF is a format in which pictures meta data can be found. These meta data may include information including device used for capturing like (iPhone 7, Samsung S4), camera specifications, GPS coordinates, orientation, etc,. </p> <h2 class=\"mb-3 mt-5\">How typically devices take picture?</h2> <p> Typically if a device takes a picture it uses its sensors to rotate the image to the right orientation. Because of this wherever we view the photo we have the correct orientation for the image. </p> <h2 class=\"mb-3 mt-5\">How iPhone takes picture?</h2> <p> iPhone, when takes the image it doesn’t rotate the image rather it keeps the image as it was taken and inserts the information with which the image can be correctly viewed. The is something like 90 degree clockwise. It expects the software used for viewing to rotate the image taken to correct orientation. </p> <h2 class=\"mb-3 mt-5\">Why does it do so?</h2> <p> hmm… maybe to save battery in iphone, or maybe it will cause a sight delay to save the image. </p> <h2 class=\"mb-3 mt-5\">What now?</h2> <p> As you thinking, this is the problem in iPhone not in Android or Laptop. To fix this issue, you have to use library that transform the image. Here I found the github ticker <a href=\"https://github.com/mosch/react-avatar-editor/issues/123\" target=\"_blank\" rel=\"noopener noreferrer\">The image is rotated in iPhone</a> </p> <p> You can use this javascript library to fix this issue: <a href=\"https://www.npmjs.com/package/fix-image-rotation\" target=\"_blank\" rel=\"noopener noreferrer\">fix-image-rotation</a>. </p> <p> Still, I have not solved this issue becuase I don't want to add another library to just fix one photo rotation problem. So, If you want to see the bug then checkout this post in iPhone. Best wishes to you from KePy :). </p>",
         "published": true,
         "created": "2020-05-21T09:04:51.272Z",
         "updated": "2020-05-21T09:04:51.272Z"
      },
      {
         "id": 17,
         "title": "Is React SEO-Friendly?",
         "url": "is-react-seo-friendly",
         "tags": [
            "react",
            "tutorial",
            "seo"
         ],
         "image": "blog/is-react-seo-friendly-logo.png",
         "description": "In this post, I'll talk about optimizing my react single page website, for search engines.",
         "body": "<h1 class=\"mb-3\">Is React SEO-Friendly?</h1> <p>In this post, I'll talk about optimizing my react single page website, for search engines.</p> <p> Hope you know about the SEO. But if you don't, SEO (<a href=\"https://en.wikipedia.org/wiki/Web_search_engine\" target=\"_blank\" rel=\"noopener noreferrer\">Search Engine</a> Optimization) is the practice of increasing the quantity and quality of traffic to your website through organic search engine results. In simple terms, currently my website is not showing in google searches. I want to list it there when someone enters the query and matches to my post. </p> <p><img src=\"/images/blog/is-react-seo-friendly-logo.png\" alt class=\"img-fluid\" /></p> <h2 class=\"mb-3 mt-5\">SEO Tips and Tricks</h2> <p> If you search on google \"SEO tips\", you will get hundreds of page results and thousands of pages. There are many things you have to learn about SEO like: <p> What your site is about? </p> <p> What the purpose is? </p> <p> How search engine bots work? </p> </p> <p>As a beginner, you can start it from little things by making changes to your current website. You can start from registering your website in <a href=\"https://search.google.com/search-console/about\" target=\"_blank\" rel=\"noopener noreferrer\">Google Search Console.</a> Then, follow this <a href=\"https://neilpatel.com/blog/10-most-important-seo-tips-you-need-to-know/\" target=\"_blank\" rel=\"noopener noreferrer\"> posts</a> 10 most important tips to improve your page rank. You can still checkout this posts(<a href=\"https://goinswriter.com/website-seo-tips/\" target=\"_blank\" rel=\"noopener noreferrer\">Website SEO tips,</a> <a href=\"https://blog.hubspot.com/marketing/seo-tips\" target=\"_blank\" rel=\"noopener noreferrer\">HubSpot's SEO Team,</a> <a href=\"https://ahrefs.com/blog/seo-tips/\" target=\"_blank\" rel=\"noopener noreferrer\">Actionable SEO tips</a>) that helps you in optimization but this thing takes time.</p>  <h1 class=\"mb-3 mt-5\">How to Solve SEO Problems for React Websites?</h1> <p> As you know <a href=\"https://www.javascript.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Javascript</a> is client-side programming language. So, the browser and Google bot get empty HTML files or files with little content. Then JavaScript code downloads the content from the server and users see it on their screens. </p> <p> To solve the React web app problem with SEO, you can pre-render the posts or you can do server-side rendering. </p> <h2 class=\"mb-3 mt-5\">Pre-rendering</h2> <p> Pre-rendering is a common approach to make both single- and multi-page web apps SEO-friendly. <a href=\"https://github.com/stereobooster/react-snap\" target=\"_blank\" rel=\"noopener noreferrer\">react-snap</a> is a third-party library that pre-renders pages on your site into static HTML files. Follow <a href=\"https://www.npmjs.com/package/react-snap\" target=\"_blank\" rel=\"noopener noreferrer\">official document</a> to work with react snap. </p> <h2 class=\"mb-3 mt-5\">Server-side rendering</h2> <p> In terms of SEO, client-side rendering is a problem, as Google bots don’t get any content or get a little content they can’t index properly. This method is kind of tricky but it's very very helpful in SEO. This(<a href=\"https://www.freecodecamp.org/news/server-side-rendering-your-react-app-in-three-simple-steps-7a82b95db82e/\" target=\"_blank\" rel=\"noopener noreferrer\">React server-side rendering</a>) tutorial gives step by step instruction to make your react application render server side. </p> <p> You can watch this(<a href=\"https://www.youtube.com/watch?v=rKgF0rf009c\" target=\"_blank\" rel=\"noopener noreferrer\">Make your React web apps discoverable - JavaScript SEO</a>) video tutorial to get more information. </p> <p> Overall, Pre-rendering is less complex than server rendering, but also provides a way to improve First Paint times in your application. Happy coding :) </p>",
         "published": true,
         "created": "2020-05-22T06:19:12.565Z",
         "updated": "2020-05-22T06:19:12.565Z"
      },
      {
         "id": 18,
         "title": "Two new functionality on my blog",
         "url": "two-new-functionality-on-my-blog",
         "tags": [
            "react"
         ],
         "image": "blog/two-new-functionality-on-my-blog-logo.png",
         "description": "The incredible period after writing an exam.",
         "body": "<h1 class=\"mb-3 mt-5\">Today, I have added two new functionalities on my blog that ease of using a blog posts.</h1> <p> I implemented search and tag functionality. By implementing this features, I have learned to pass data between the components. You can follow this(<a href=\"https://medium.com/@ruthmpardee/passing-data-between-react-components-103ad82ebd17\" target=\"_blank\" rel=\"noopener noreferrer\">How to pass data between react components</a>) tutorial to pass data between components. </p> <p> In search functionality, it will filter out data on every character input. So, you do not have to click enter for search. This will done dynamically. Also, post lists are updated without refreshing the pages. </p> <p><img src=\"/images/blog/two-new-functionality-on-my-blog-logo.png\" alt class=\"img-fluid\" /></p> <p> Check it out this functionalities <a href=\"#/blog/index\">here</a>. </p>",
         "published": true,
         "created": "2020-05-22T23:08:14.942Z",
         "updated": "2020-05-22T23:08:14.942Z"
      },
      {
         "id": 19,
         "title": "Officially Commenced My Journey at ABB",
         "url": "officially-commenced-my-journey-at-abb",
         "tags": [
            "ABB",
            "internship"
         ],
         "image": "blog/officially-commenced-my-journey-at-abb-logo.png",
         "description": "The Next Big Thing in USA",
         "body": "<h1 class=\"mb-3 mt-5\">The Next Big Thing in the USA</h1> <p> I am super excited to share that I finished my first week back at <a href=\"https://new.abb.com/\">ABB</a> as the LEAD Intern! I would like to thank the onboarding team for such a seamless virtual onboarding experience despite the current pandemic. Also, I am grateful to my manager and colleagues for an extremely warm welcome and for making this process, a smooth one. </p> <p><img src=\"/images/blog/officially-commenced-my-journey-at-abb-1.png\" alt class=\"img-fluid\" /></p> <h2 class=\"mb-3 mt-5\">Hit the road (First week experience)</h2> <p> No matter how many times I do a thing, I would still feel giddy, nervous, anxiety and all the other emotions which were there when i did it for the first time. This does not mean that I am a nervous wreck it just means that I care about that event too much and want to give my best. On the first day, I had so many questions going in my mind. But, after I met with my manager and colleagues, I felt relief. </p> <p><img src=\"/images/blog/officially-commenced-my-journey-at-abb-logo.png\" alt class=\"img-fluid\" /></p> <p> This week I've learned a lot. <ul> <li> Privilege to meet with great colleagues </li> <li> Setting up my desk and system </li> <li> Learned about the project </li> <li> Familiar with the facility of ABB </li> </ul> Also, they have taken so many <a href=\"https://www.cdc.gov/coronavirus/2019-ncov/index.html\">COVID-19</a> safety precautions to protect their employees. </p> <h2 class=\"mb-3 mt-5\">Down the road</h2> <p> I'm grateful that this company is still able to host interns this summer in this global pandemic. I can't wait to see what we'll build this summer. Also, I'm very excited to see what the rest of the summer has in store for me! Grateful to have a new opportunity and going to give it 110%. </p>\n\n",
         "published": true,
         "created": "2020-06-13T22:17:24.571Z",
         "updated": "2020-06-13T22:17:24.571Z"
      },
      {
         "id": 20,
         "title": "Hide option to Publish to SharePoint in MS Access",
         "url": "hide-option-to-publish-to-sharepoint-in-ms-access",
         "tags": [
            "ABB",
            "internship",
            "MS-Access"
         ],
         "image": "blog/hide-option-to-publish-to-sharepoint-in-ms-access-logo.png",
         "description": "How to prevent “Save to SharePoint Site” alert in Access",
         "body": "<h1 class=\"mb-3 mt-5\">Hide option to Publish to SharePoint in MS Access</h1> <p> Microsoft has been binding Office to <a href=\"https://www.microsoft.com/skydrive\" target=\"_blank\">Skydrive</a>/<a href=\"https://onedrive.live.com/\" target=\"_blank\">Onedrive</a>/<a href=\"https://www.microsoft.com/en-us/microsoft-365/sharepoint/collaboration\" target=\"_blank\">SharePoint</a> more and more since 2013. For those of us who don't use the cloud, this integration is more of a headache than a beneficial feature. </p> <h2 class=\"mb-3 mt-5\">Problem</h2> <p> Whenever user open the <a href=\"https://www.microsoft.com/en/microsoft-365/access\" target=\"_blank\">Microsoft Access</a> file, the yellow alert bar that says \"Save to SharePoint Site\" is showing up. However, user don't want to do it but it pops up again and again on starting. Many people are posting about this problem, even I found a post that posted in Microsoft Community page on December 7, 2012. and I found only one reply that posted after 3 years from another user. The user commented: \"Sad that nobody at MS can answer this question, even to say \"no, it is not possible\". Check out article <a href=\"https://answers.microsoft.com/en-us/msoffice/forum/all/access-2010-remove-save-to-sharepoint-site-yellow/cc0e7141-62fd-499c-a33d-87c11fb60bac\" target=\"_blank\">Access 2010: Remove \"Save to SharePoint Site\" yellow bar</a> </p> <p><img src=\"/images/blog/hide-option-to-publish-to-sharepoint-in-ms-access-1.png\" alt class=\"img-fluid\" /></p> <h2 class=\"mb-3 mt-5\">Solution</h2> <p> The below solution can work on all of these Access version: Access 2003 (version 11.5), Access 2007 (version 12.0), Access 2010 (version 14.0), and Access 2013 (version 15.0). (source: <a href=\"https://en.wikipedia.org/wiki/Microsoft_Access\" target=\"_blank\">wiki</a>) </p> <p> Steps: <ul> <li> Create the new form in MS Access (From Menu bar-> Select <b>Create</b> -> Click on <b>Form</b>) </li> <li> Save that form as \"RemoveAlert\" and open \"Design View\" of that form </li> <li> Right click anywhere in \"RemoveAlert\" form and click \"Form Properties\" </li> <li> Toolbar will appear on right hand side. Toolbar -> Event -> On Load (Click on three dots appear in right hand side) </li> <li> Choose \"Code Builder\" from the menu </li> <li> Then it will open Microsoft Visual Basic and paste this line \"CurrentDb.Properties.Delete\" and Save </li> </ul> </p> <p> In the end, you code will look like this: <figure> <pre><code>Private Sub Form_Load() \n CurrentDb.Properties.Delete (\"PublishURL\") \n End Sub</code></pre> </figure> </p> <p> Now, just reopen that form. Boom! Now your problem is solved. Try and check it out by reopening the MS Access file. Also, You can delete the \"RemoveAlert\" form. </p> <p> I found an idea from this article: <a href=\"http://www.utteraccess.com/forum/Remove-save-Sharepoint-t2000044.html\" target=\"_blank\">Prevent “Save to SharePoint Site” alert in Access</a>. The user commented to put the line in a sub: \"CurrentDb.Properties.Delete (\"PublishURL\")\" but I don't know where can I put this. So, I tried and it was worked. </p> <p> Hope this post helps someone. Take care and Have a great day ahead. </p>",
         "published": true,
         "created": "2020-06-17T15:41:48.134Z",
         "updated": "2020-06-17T15:41:48.134Z"
      },
      {
         "id": 21,
         "title": "Building web application from scratch",
         "url": "building-web-application-from-scratch",
         "tags": [
            "ABB",
            "internship",
            "react",
            "node",
            "Postgre"
         ],
         "image": "blog/building-web-application-from-scratch-logo.png",
         "description": "In this post, I'm going to show which web technologies and database I have choose to create new web application.",
         "body": "<h1 class=\"mb-3 mt-5\">Building web application from scratch</h1> <p> I have started working on creating a web application at ABB. I'll be working on this project alone so I have to gather all the requirement and decide which programming languages to use to full-fill the requirement. I think spending time on project plan instead of directly jump on to the programming is less burden and beneficial decision later on. </p> <h2 class=\"mb-3 mt-5\">Language Selection</h2> <p> When a programming language decision must be made, programs should conduct a trade study to determine the best computer programming language, or mix of programming languages, to be used to satisfy system life cycle requirements. Each programming language has their own benefits but choosing the right programming language saves a lot of time. How? <ul> <li>Easiness of maintaining the code</li> <li>Faster performance</li> <li>Reuse --- You can use existing library/packages to complete task </li> <li>Support --- If technology is well known so you can get lot of support and bug solution from the internet</li> <li>Extent of compatibility with and impact of other related direction</li> </ul> </p> <p> To make a data-centric web app from the bottom-up, it is advantageous to plan below things: <ul> <li>Web front end (HTML, CSS, Javascript) - for the look and feel of your web app</li> <li>Backend language (e.g. Node.js, Python, Ruby) - control how your web app works</li> <li>Database (Oracle, PostgreSQL) - to store the data of the application</li> <li>DevOps (Github, Jenkins) - Deploying / hosting your web app</li> </ul> </p> <p><img src=\"/images/blog/building-web-application-from-scratch-logo.png\" alt class=\"img-fluid\" /></p> <h2 class=\"mb-3 mt-5\">Frontend technology</h2> <p> User experience is the number one priority for every business in the market today. As a developer, even the brief you get on your project talks about the simplicity of the user interface it is supposed to feature. No matter how complex functions and operations happen in the background, what users see and experience has to be seamless. </p> <h3 class=\"mb-3 mt-5\">Best Frontend Framework 2020</h3> <p> I choose <a href=\"https://reactnative.dev/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>React</b></a> over all other frameworks in the market. There were multiple reasons behind this but one of the main thing is popularity. </p> <p> Talking about the relative popularity of each framework, the below graph shows the overall usage popularity of each framework listed for best frontend frameworks in 2020. We can see that after the year 2015-16, Angular and React have been in huge demand. </p> <p><img src=\"/images/blog/building-web-application-from-scratch-1.png\" alt class=\"img-fluid\" /></p> <p> Also, One of the simplest frameworks to learn – React – was developed at Facebook to fix code maintainability issues due to the constant addition of features in the app. An open-source framework now, React stands out because of its virtual Document Object Model (DOM), which offers its exceptional functionality. An ideal framework for those who anticipate high traffic and need a stable platform to handle it. </p> <h2 class=\"mb-3 mt-5\">Backend language</h2> <p> The backend programming language is also known as server side programming. The name given to all types of programs which run on the web server. They process the user input, interact with the databases and control what content is served back to the client as a response to his request. It is written in a number of programming languages including PHP, NodeJS, Python, etc and has full access to the server’s OS and the programmer can chose the language he/she wants to code in. </p> <p> I'm going to code in the <a href=\"https://nodejs.org/en/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>Node.js</b></a> language. Node.js is the newest in the list (released in 2009) and the quickest growing today. It provides the ability to run JavaScript code server-side. The great thing is that I do not have to learn a new language for back-end development. I'll use Javascript as backend and frontend development. It's also helpful to full stack development. </p> <p><img src=\"/images/blog/building-web-application-from-scratch-2.png\" alt class=\"img-fluid\" /></p> <h2 class=\"mb-3 mt-5\">Database</h2> <p> There are hundreds of tech-heavy database reviews out there, but they don’t always give clear guidance on the first step in selecting a database: choosing the best general type for a specific application. All databases are not created equal. Each has specific strengths and weaknesses. </p> <p> I choose <a href=\"https://www.postgresql.org/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>PostgreSQL</b></a> database to store the data for our application. I have an option to choose NoSQL database but our application have certain limits so I went for RDMS. Also, postgre is an Enterprise-class relational database system. It is easy to setup and installs. It offers support for SQL and NoSQL. It has a great community which happy to serve you when you are facing issues while using PostgreSQL. </p> <h2 class=\"mb-3 mt-5\">DevOps</h2> <p> I'll use <a href=\"https://github.com/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>Github</b></a> as version control software as I'm the only one creating, maintaining this project. GitHub is occupies by far the largest market share. In fact, it was bought out by Microsoft last year, which actually made people to choose it. </p> <p> Overall, I selected technologies that I'll work on. Now, I'll create project plan according to our project requirements. </p>",
         "published": true,
         "created": "2020-06-19T21:44:04.571Z",
         "updated": "2020-06-19T21:44:04.571Z"
      },
      {
         "id": 22,
         "title": "Database Designing",
         "url": "database-designing",
         "tags": [
            "ABB",
            "internship",
            "Postgre"
         ],
         "image": "blog/database-designing-logo.png",
         "description": "Important rules to keep in mind when designing the database.",
         "body": "<h1 class=\"mb-3 mt-5\">Database Designing</h1> <p> After selecting web technologies and database, I'm moving forward to designing the database for my project. I read many articles regarding database design. So, I want to list out few important rules that are different from the common rules. </p> <p><img src=\"/images/blog/database-designing-logo.png\" alt class=\"img-fluid\" /></p> <h2 class=\"mb-3 mt-5\">1) Nature of the application (OLTP or OLAP)</h2> <p> When you start your database design the first thing to analyze is the nature of the application you are designing for, is it Transactional or Analytical. </p> <p> <b>Transactional</b>: In this kind of application, your end user is more interested in CRUD, i.e., creating, reading, updating, and deleting records. The official name for such a kind of database is OLTP. </p> <p> <b>Analytical</b>: In these kinds of applications your end user is more interested in analysis, reporting, forecasting, etc. These kinds of databases have a less number of inserts and updates. The main intention here is to fetch and analyze data as fast as possible. The official name for such a kind of database is OLAP. </p> <p><img src=\"/images/blog/database-designing-1.png\" alt class=\"img-fluid\" /></p> <p> In other words if you think inserts, updates, and deletes are more prominent then go for a normalized table design, else create a flat denormalized database structure. </p> <h2 class=\"mb-3 mt-5\">2) Naming Convention</h2> <p> A naming convention is an important part of a well-built data model. Look at the database model below. The model is not very fun to look at, to try to understand, or to code around. </p> <p><img src=\"/images/blog/database-designing-2.png\" alt class=\"img-fluid\" /></p> <p> Let’s start with some things that you should consider if you need to create a new naming convention. You want to give name that follows across the whole database. </p> <p> The case of the name. You can choose between: <ul> <li>UPPERCASE names - All name in uppercase</li> <li>lowercase names - All name in lowercase</li> <li>camelCase names – the name starts with a lowercase letter, but new words start with an uppercase letter</li> <li>PascalCaseNames (also known as upper camel) – similar to camelCase, but the name starts with an uppercase letter, as do all additional words</li> <li>Underscore - you can separate them with an underscore (like_this)</li> </ul> </p> <h2 class=\"mb-3 mt-5\">3) Data types</h2> <p> We deal with different types of data such as strings, characters, whole numbers (integers), and decimal numbers (floating point numbers). Similarly, when we write a computer program to process different types of data, we need to specify its type clearly. </p> <p> PostgreSQL supports many data types. Here, I list out few points to choose data type: <ul> <li>Choose BIGINT for primary ID. Many developer face issues to convert INTEGER to BIGINT later on.</li> <li>Store all timestamps using UTC.</li> <li>Always use a library to perform date and time math.</li> <li>Use a standard time offset.</li> </ul> </p> <h2 class=\"mb-3 mt-5\">4) Break data into logical pieces</h2> <p> This rule is actually the first rule from 1st normal form. Better approach would be to break table field into further logical pieces so that we can write clean and optimal queries. </p> <p> However, I want to add here. <b>\"Break data into logical pieces but don't overdose it\"</b> </p> <p> Developers are cute creatures. If you tell them this is the way, they keep doing it; well, they overdo it leading to unwanted consequences. For example: you can see the phone number field; it’s rare that you will operate on ISD codes of phone numbers separately (until your application demands it). So it would be a wise decision to just leave it as it can lead to more complications. </p> <p><img src=\"/images/blog/database-designing-3.png\" alt class=\"img-fluid\" /></p> <p> PostgreSQL supports many data types. Here, I list out few points to choose data type: <ul> <li>Choose BIGINT for primary ID. Many developer face issues to convert INTEGER to BIGINT later on.</li> <li>Store all timestamps using UTC.</li> <li>Always use a library to perform date and time math.</li> <li>Use a standard time offset.</li> </ul> </p> <p> You can follow these tutorials for more details: </p> <p>1) <a href=\"https://www.guru99.com/postgresql-data-types.html\" target=\"_blank\" rel=\"noopener noreferrer\">PostgreSQL Data Types</a></p> <p>2) <a href=\"https://www.postgresqltutorial.com/postgresql-data-types/\" target=\"_blank\" rel=\"noopener noreferrer\">Getting started with PostgreSQL Data Types</a></p> <p>3) <a href=\"https://medium.com/@vivekmadurai/how-to-deal-with-date-and-time-across-time-zones-39b1bd747f35\" target=\"_blank\" rel=\"noopener noreferrer\">How to Deal with Date and Time across Time Zones</a></p>",
         "published": true,
         "created": "2020-06-21T14:19:24.571Z",
         "updated": "2020-06-21T14:19:24.571Z"
      }
   ]
}